cask_args appdir: "/Applications"

tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/services"
tap "thoughtbot/formulae"

# General tools
brew "mas" # For installing Mac Application Store applications
brew "rcm" # For managing dotfiles

# Databases
brew "mysql"
brew "postgresql"
brew "redis"

# Development Tools
brew "awscli"
brew "tmux"

# Language Management
brew "nvm"
brew "rbenv"
brew "yarn", args: ["ignore-dependencies"]
brew "pyenv"
brew "pyenv-virtualenv"
cask "java"

# Utilities
cask "docker"
cask "dropbox"
cask "google-backup-and-sync"
cask "keybase"

# Development Applications
cask "iterm2"
brew "mitmproxy"
cask "sequel-pro"
cask "tableplus"
cask "visual-studio-code"

# General Applications
cask "1password"
cask "firefox"
cask "google-chrome"
cask "slack"
cask "sonos"
cask "spotify"
cask "typora"
