cask_args appdir: "/Applications"

tap "homebrew/cask"
tap "homebrew/services"
tap "thoughtbot/formulae"

# General tools
brew "mas" # For installing Mac Application Store applications
brew "rcm" # For managing dotfiles

# Development Tools
brew "mysql"
brew "postgresql"
brew "redis"
brew "rbenv"
brew "tmux"

# Applications
cask "1password"
cask "atom"
cask "docker"
cask "firefox"
cask "google-chrome"
cask "slack"
cask "sonos"
cask "spotify"
cask "typora"
